In [2]:
import pandas as pd

Using dictionries:

In [3]:
data = {
    'Name': ['Tamanna', 'Faysal', 'Tarek', 'Raisa', 'Imtiaz', 'Farah'],
    'Age': [24, 27, 22, 32, 24, 22],
    'City': ['Dhaka', 'Sylthet', 'Dhaka', 'Khulna', 'Rajshahi', 'Sylhet'],
    'Score': [85, 95, 78, 90, 88, 84]
}
df = pd.DataFrame(data)
df.head()

      Name  Age      City  Score
0  Tamanna   24     Dhaka     85
1   Faysal   27   Sylthet     95
2    Tarek   22     Dhaka     78
3    Raisa   32    Khulna     90
4   Imtiaz   24  Rajshahi     88

Using Tuples/Lists:

In [4]:
data = [
    ('Tarek', 24, 'Dhaka'),
    ('Barek', 23, 'Faka'), 
    ('Parek', 21, 'Chaka')
]

columns = ['Name', 'Age', 'City']

df = pd.DataFrame(data, columns=columns)
df

    Name  Age   City
0  Tarek   24  Dhaka
1  Barek   23   Faka
2  Parek   21  Chaka

List of Dictionaries:

In [5]:
data = [
    {'Name' : 'Anik', 'Age': 24, 'City': 'Dhaka'},
    {'Name': 'Musfique', 'Age': 22, 'City':'Noakhali'},
    {'Name': 'Tasfiya', 'Age': 25, 'City':'Chitagong'}
]

df = pd.DataFrame(data=data)
print(df)
print(df.shape)
print(df.size)

       Name  Age       City
0      Anik   24      Dhaka
1  Musfique   22   Noakhali
2   Tasfiya   25  Chitagong
(3, 3)
9

In [7]:
df = pd.read_csv("C:\Musfique's Folder\Python\FDS\Web Scrapping\Phone Price\laptop_data.csv")
df

<>:1: SyntaxWarning: invalid escape sequence '\M'
<>:1: SyntaxWarning: invalid escape sequence '\M'
C:\Users\PC\AppData\Local\Temp\ipykernel_14908\2862459660.py:1: SyntaxWarning: invalid escape sequence '\M'
  df = pd.read_csv("C:\Musfique's Folder\Python\FDS\Web Scrapping\Phone Price\laptop_data.csv")

                                                 Model         Price
0    Lenovo IdeaPad Flex 5 14ALC7 AMD Ryzen 5 5500U...         95000
1    Lenovo IdeaPad Flex 5 14ALC7 AMD Ryzen 7 5700U...        107000
2    Lenovo IdeaPad D330 10IGL Celeron N4020 10.1" ...         28500
3    Lenovo IdeaPad Pro 5 16AHP9 Ryzen 7 8845HS AI ...        159000
4    Lenovo Legion Slim 5 16AHP9 Ryzen 7 8845HS AI ...        250000
..                                                 ...           ...
119  Lenovo IdeaPad Slim 3 Ryzen 5 7520U 14" FHD La...  Out Of Stock
120  Lenovo LOQ 15AHP9 Ryzen 7 8845HS AI Integrated...  Out Of Stock
121  Lenovo IdeaPad Slim 3 14ABR8 Ryzen 7 7730U Aby...  Out Of Stock
122  Lenovo IdeaPad Slim 3 Ryzen 5 7520U 15.6" FHD ...  Out Of Stock
123  Lenovo Yoga 7 2-in-1 14AHP9 Ryzen 7 8840HS AI ...  Out Of Stock

[124 rows x 2 columns]

In [8]:
df.shape

(124, 2)